### This will read a csv file

In [14]:
import pandas as pd
filename = 'tips.csv'
df = pd.read_csv(filename)

In [15]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [22]:
print(sum(df['total_bill']))

4827.770000000001

In [32]:
df[['total_bill','tip','size']]

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

### Iloc, loc and ix

In [35]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [38]:
df.loc[0,'total_bill']

16.99

In [41]:
df.loc[1,['sex','day','size']]

sex     Male
day      Sun
size       3
Name: 1, dtype: object

In [43]:
df.iloc[0,0]

16.99

In [44]:
df.iloc[1,1]

1.66

### Slicing using loc and iloc

In [45]:
df.loc[0:2,'sex']

0    Female
1      Male
2      Male
Name: sex, dtype: object

In [47]:
df.iloc[0::3,0::2]

     total_bill     sex   day  size
0         16.99  Female   Sun     2
3         23.68    Male   Sun     2
6          8.77    Male   Sun     2
9         14.78    Male   Sun     2
12        15.42    Male   Sun     2
..          ...     ...   ...   ...
231       15.69    Male   Sat     3
234       15.53    Male   Sat     2
237       32.83    Male   Sat     2
240       27.18  Female   Sat     2
243       18.78  Female  Thur     2

[82 rows x 4 columns]

In [56]:
df.iloc[0:100,::2]

    total_bill     sex  day  size
0        16.99  Female  Sun     2
1        10.34    Male  Sun     3
2        21.01    Male  Sun     3
3        23.68    Male  Sun     2
4        24.59  Female  Sun     4
..         ...     ...  ...   ...
95       40.17    Male  Fri     4
96       27.28    Male  Fri     2
97       12.03    Male  Fri     2
98       21.01    Male  Fri     2
99       12.46    Male  Fri     2

[100 rows x 4 columns]

In [57]:
df['sex'].unique()

array(['Female', 'Male'], dtype=object)

### list table with tip <10

In [62]:
df1 = df[df['tip'] < 10]
df1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[243 rows x 7 columns]

### save to a new csv file

In [63]:
df1.to_csv('high_tip.csv')

### This will read a excel file

In [8]:
import pandas as pd
filename = input('Enter excel file name: ')
file1 = pd.read_excel(filename)

Enter excel file name: May 2020 Quang.xlsx

In [9]:
file1.head()

,Unnamed: 0,Employee Timesheet - Dalriada Therapeutics,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,NaN,Day,Canopy,Janpix,Outsourcing/Miscellaneous,NaN,NaN,NaN,Admin,Total hours,Comments \n(Define Project 1/2 and miscellaneous)
1,Employee Name,NaN,NaN,NaN,Project 1,Project 2,Ubiquigent,Miscellaneous,NaN,NaN,NaN
2,Quang Huy To,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,2 = HPK1
3,Month / Year,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN
4,2/2020,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN